app/Http/Controllers/ClientsController.php

    public function index(){

       $clients = Client::all();
---
select * from `clients`

    public function create(){

        $entreprises = Entreprise::all();
---
select * from `entreprises`